GoalApp/app/views/goals/_form.html.erb

  <select class="" name="goal[user_id]">
    <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"