GoalApp/app/controllers/goals_controller.rb

  def index
    @goals = Goal.all
---
SELECT "goals".* FROM "goals"

  def create
    @goal = Goal.new(goal_params)
    if @goal.save
---
INSERT INTO "goals" ("user_id", "state", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", "1"], ["state", "public"], ["created_at", "2018-09-14 23:50:39.900320"], ["updated_at", "2018-09-14 23:50:39.900320"], ["title", "do better things"]]