GoalApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "ej@ej2.com"], ["password_digest", "$2a$10$5DQJ.TPHXQr2Dsd4AF/yUeL2biv/TJGngZUHDobG754wVXJ39diS2"], ["updated_at", "2018-09-14 21:30:49.041636"], ["id", 76]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 134], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 134]]
---
  def destroy
    @user = User.find(params[:id])

    if @user.delete